app/views/games/show.html.erb


  $(".action").click(function (event ) {
      board[this.dataset.row][this.dataset.column] = current_player()
      data = JSON.stringify({"data":{"attributes":{"board":board},
              "type":"game"
          }})
          // debugger
      $.ajax({url:window.location,contentType:"application/json",method:"POST",data:data, function (data,status) {
              window.reload()
          }})
  })
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]