app/controllers/games_controller.rb

  def index
    @games = Game.all
---
SELECT "games".* FROM "games"

  def create
    @game = Game.new(game_attributes)

    respond_to do |format|
      if @game.save
---
INSERT INTO "games" ("playerone", "playertwo", "board", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @game.update(game_attributes)
        @game.board =  params['data']['attributes']['board'].to_json
        @game.save
---
UPDATE "games" SET "board" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["board", "[[null,null,null],[null,1,null],[null,null,null]]"], ["updated_at", "2018-12-10 20:40:58.822573"], ["id", 18]]
UPDATE "games" SET "board" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["board", "{\"0\":[\"\",\"\",\"\"],\"1\":[\"\",\"0\",\"\"],\"2\":[\"\",\"\",\"\"]}"], ["updated_at", "2018-12-10 21:16:40.352813"], ["id", 21]]

    def set_game
      @game = Game.find(params[:id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]